import React from 'react';
import Article from '../../components/article/Article';
import { blog01, blog02, blog03, blog04, blog05 } from './imports';
import './blog.css';

const Blog = () => {
  const blog01text = 'Η React περιλαμβάνει μια αρχιτεκτονική JavaScript που ονομάζεται Flux που χρησιμοποιεί έναν κεντρικό διεκπεραιωτή για να κατευθύνει δεδομένα προς μία κατεύθυνση κάθε φορά που συμβαίνει ένα συμβάν διεπαφής χρήστη, αυτό ονομάζεται μονόδρομη σύνδεση δεδομένων. '
+ 'Το κύριο πλεονέκτημα της μονόδρομης σύνδεσης δεδομένων είναι η ικανότητά του να συγχρονίζει δεδομένα και να τροποποιεί μια εφαρμογή γρήγορα και εύκολα, ειδικά σε σύγκριση με τη διαδικασία αμφίδρομης δέσμευσης δεδομένων που συναντάται συνήθως '
+ 'σε πλαίσια όπως το Angular.js. Αυτή η μέθοδος είναι ιδιαίτερα χρήσιμη σε πολύπλοκες εφαρμογές, καθιστώντας και τις δύο ευκολότερες στον εντοπισμό σφαλμάτων, τη συντήρηση και την ανάπτυξη τους με την πάροδο του χρόνου.';

  const blog02text = ' Η δημοτικότητα του React οφείλεται κυρίως στην ικανότητά του να απλοποιεί τη δημιουργία και τη διαχείριση του UI μιας εφαρμογής και να βελτιώνει τη συνολική απόδοση του ιστότοπου, αλλά υπάρχουν πρόσθετοι παράγοντες που έχουν συμβάλει '
+ 'στην ανάπτυξή του. Η επιτυχία της React μπορεί επίσης να αποδοθεί σε μεγάλο βαθμό στον δημιουργό του: το Facebook. Το React σχεδιάστηκε μόνο από ανάγκη για να βοηθήσει στον εξορθολογισμό της διεπαφής χρήστη του Facebook και να διευκολύνει τη '
+ 'διαχείριση της εφαρμογής καθώς μεγάλωνε. Μόλις το React έγινε ανοιχτού κώδικα, είχε άμεσο κοινό λόγω της θέσης του Facebook ως της μεγαλύτερης πλατφόρμας μέσων κοινωνικής δικτύωσης στον κόσμο.';

  const blog03text = 'Μετά την κυκλοφορία της React στο κοινό, χρειάστηκαν αρκετά χρόνια για να αποκτήσει δυναμική η δημοτικότητα της βιβλιοθήκης. Ευτυχώς, οι προγραμματιστές ανακάλυψαν σύντομα ότι η React ήταν πιο εύκολη στην εκμάθηση και την εφαρμογή σε σύγκριση με '
+ 'εναλλακτικές λύσεις και άρχισαν να το χρησιμοποιούν με μεγαλύτερη συνέπεια. Γρήγορα δημιουργήθηκε μια ακμάζουσα κοινότητα που συνέβαλε στην επέκταση της React. Η κοινότητα προγραμματιστών συνεχίζει να παρέχει πολύτιμη υποστήριξη μέσω ιστότοπων'
+ 'όπως το Stack Overflow και το Github, βοηθώντας ο ένας τον άλλον να επιλύσει τυχόν προβλήματα που σχετίζονται με τη React.';

  const blog04text = 'Με τη δύναμη του Facebook πίσω από αυτό και μια ακμάζουσα κοινότητα να το υποστηρίζει, η React τράβηξε σύντομα τα βλέμματα ορισμένων πολύ μεγάλων εταιρείων. Οι προγραμματιστές front end στα Airbnb, Netflix, Shopify, Salesforce, '
+ 'Walmart και Amazon άρχισαν να χρησιμοποιούν τη React για να δημιουργήσουν τη διεπαφή χρήστη στις εφαρμογές των εταιρειών τους, κάτι που απλώς ενίσχυσε ακόμη περισσότερο τη δημοτικότητα της βιβλιοθήκης. Η React έχει πλέον ξεπεράσει τη '
+ 'δημοτικότητα του jQuery με περισσότερο από το 40% των προγραμματιστών να χρησιμοποιούν τακτικά React.';

  const blog05text = 'Το React JS παρέχει τη δυνατότητα βελτιστοποίησης όλων των επαναχρησιμοποιήσιμων στοιχείων, γεγονός που επιτρέπει στους προγραμματιστές εφαρμογών να συμπεριλάβουν τα νέα μέρη στην ανάπτυξη των εφαρμογών τους. Ένας προγραμματιστής εφαρμογών μπορεί να παρακολουθεί την έγκαιρη πρόοδο ολόκληρου του έργου όταν χρησιμοποιεί το ReactJS.'
+ 'Η ανάπτυξη των εφαρμογών γίνεται ταχύτερη με τη βοήθεια του React Native. Πρόκειται για ένα πολύ δημοφιλές και γνωστό πλαίσιο ανοικτού κώδικα στον κλάδο της ανάπτυξης και χρησιμοποιείται για τη δημιουργία εφαρμογών τόσο για iOS όσο και για Android. Η απόδοση δεν θα εμποδίζεται αν και ο χρόνος που δαπανάται θα μειώνεται.';

  return (
    <div className="reactp__blog section__padding" id="blog">
      <div className="reactp__blog-heading">
        <h1 className="gradient__text">Πρόσθετοι λόγοι <br /> για τη δημοτικότητα του React</h1>
      </div>
      <div className="reactp__blog-container">
        <div className="reactp__blog-container_groupA">
          <Article
            imgUrl={blog01}
            title="Μονόδρομη δέσμευση δεδομένων"
            text={blog01text}
          />
        </div>
        <div className="reactp__blog-container_groupB">
          <Article imgUrl={blog02} title="Δημιουργία και διαχείριση UI" text={blog02text} />
          <Article imgUrl={blog03} title="H δημοτικότητα της βιβλιοθήκης" text={blog03text} />
          <Article imgUrl={blog04} title="Η δύμαμη του Facebook" text={blog04text} />
          <Article imgUrl={blog05} title="Ταχύτερη ανάπτυξη εφαρμογών" text={blog05text} />
        </div>
      </div>
    </div>
  );
};

export default Blog;
