import blog01 from '../../assets/blog01.png';
import blog02 from '../../assets/blog02.png';
import blog03 from '../../assets/blog03.png';
import blog04 from '../../assets/blog04.png';
import blog05 from '../../assets/blog05.png';

const blog02text = ' Η δημοτικότητα του React οφείλεται κυρίως στην ικανότητά του να απλοποιεί τη δημιουργία και τη διαχείριση του UI μιας εφαρμογής και να βελτιώνει τη συνολική απόδοση του ιστότοπου, αλλά υπάρχουν πρόσθετοι παράγοντες που έχουν συμβάλει '
+ 'στην ανάπτυξή του. Η επιτυχία της React μπορεί επίσης να αποδοθεί σε μεγάλο βαθμό στον δημιουργό του: το Facebook. Το React σχεδιάστηκε μόνο από ανάγκη για να βοηθήσει στον εξορθολογισμό της διεπαφής χρήστη του Facebook και να διευκολύνει τη '
+ 'διαχείριση της εφαρμογής καθώς μεγάλωνε. Μόλις το React έγινε ανοιχτού κώδικα, είχε άμεσο κοινό λόγω της θέσης του Facebook ως της μεγαλύτερης πλατφόρμας μέσων κοινωνικής δικτύωσης στον κόσμο.';

const blog03text = 'Μετά την κυκλοφορία της React στο κοινό, χρειάστηκαν αρκετά χρόνια για να αποκτήσει δυναμική η δημοτικότητα της βιβλιοθήκης. Ευτυχώς, οι προγραμματιστές ανακάλυψαν σύντομα ότι η React ήταν πιο εύκολη στην εκμάθηση και την εφαρμογή σε σύγκριση με '
+ 'εναλλακτικές λύσεις και άρχισαν να το χρησιμοποιούν με μεγαλύτερη συνέπεια. Γρήγορα δημιουργήθηκε μια ακμάζουσα κοινότητα που συνέβαλε στην επέκταση της React. Η κοινότητα προγραμματιστών συνεχίζει να παρέχει πολύτιμη υποστήριξη μέσω ιστότοπων'
+ 'όπως το Stack Overflow και το Github, βοηθώντας ο ένας τον άλλον να επιλύσει τυχόν προβλήματα που σχετίζονται με τη React.';

const blog04text = 'Με τη δύναμη του Facebook πίσω από αυτό και μια ακμάζουσα κοινότητα να το υποστηρίζει, η React τράβηξε σύντομα τα βλέμματα ορισμένων πολύ μεγάλων εταιρείων. Οι προγραμματιστές front end στα Airbnb, Netflix, Shopify, Salesforce, '
+ 'Walmart και Amazon άρχισαν να χρησιμοποιούν τη React για να δημιουργήσουν τη διεπαφή χρήστη στις εφαρμογές των εταιρειών τους, κάτι που απλώς ενίσχυσε ακόμη περισσότερο τη δημοτικότητα της βιβλιοθήκης. Η React έχει πλέον ξεπεράσει τη '
+ 'δημοτικότητα του jQuery με περισσότερο από το 40% των προγραμματιστών να χρησιμοποιούν τακτικά React.';

const blog05text = 'Το React JS παρέχει τη δυνατότητα βελτιστοποίησης όλων των επαναχρησιμοποιήσιμων στοιχείων, γεγονός που επιτρέπει στους προγραμματιστές εφαρμογών να συμπεριλάβουν τα νέα μέρη στην ανάπτυξη των εφαρμογών τους. Ένας προγραμματιστής εφαρμογών μπορεί να παρακολουθεί την έγκαιρη πρόοδο ολόκληρου του έργου όταν χρησιμοποιεί το ReactJS.'
+ 'Η ανάπτυξη των εφαρμογών γίνεται ταχύτερη με τη βοήθεια του React Native. Πρόκειται για ένα πολύ δημοφιλές και γνωστό πλαίσιο ανοικτού κώδικα στον κλάδο της ανάπτυξης και χρησιμοποιείται για τη δημιουργία εφαρμογών τόσο για iOS όσο και για Android. Η απόδοση δεν θα εμποδίζεται αν και ο χρόνος που δαπανάται θα μειώνεται.';

export {
  blog01,
  blog02,
  blog03,
  blog04,
  blog05,
  blog02text,
  blog03text,
  blog04text,
  blog05text,
};
