const whatIsReactText = 'Η React είναι μια βιβλιοθήκη JavaScript ανοιχτού κώδικα που χρησιμοποιείται για τη'
  + 'δημιουργία στοιχείων διεπαφής χρήστη (UI) σε εφαρμογές μιας σελίδας. Αρχικά '
  + 'δημιουργήθηκε από έναν μηχανικό λογισμικού στο Facebook για να βελτιστοποιήσει την '
  + 'εφαρμογή της εταιρείας, να βελτιώσει την απόδοσή της και να απλοποιήσει τη '
  + 'συντήρηση του κώδικα...';
const popupWhatIsReact = 'Η React είναι μια βιβλιοθήκη JavaScript ανοιχτού κώδικα που χρησιμοποιείται για τη '
  + 'δημιουργία στοιχείων διεπαφής χρήστη (UI) σε εφαρμογές μιας σελίδας. Αρχικά '
  + 'δημιουργήθηκε από έναν μηχανικό λογισμικού στο Facebook για να βελτιστοποιήσει την '
  + 'εφαρμογή της εταιρείας, να βελτιώσει την απόδοσή της και να απλοποιήσει τη '
  + 'συντήρηση του κώδικα. Η React χρησιμοποιήθηκε για πρώτη φορά στο News Feed του '
  + 'Facebook το 2011 και στη συνέχεια προστέθηκε στο Instagram αφού το Facebook '
  + 'αγόρασε την εφαρμογή το 2012. Κυκλοφόρησε στο κοινό με άδεια ανοιχτού κώδικα μόλις '
  + 'ένα χρόνο αργότερα το 2013 και έκτοτε κερδίζει σταθερά δημοτικότητα. Η React είναι '
  + 'αυτή τη στιγμή η πιο ευρέως χρησιμοποιούμενη βιβλιοθήκη κώδικα μεταξύ των'
  + 'προγραμματιστών Ιστού, με περισσότερο από το 40% των ερωτηθέντων από το Stack'
  + 'Overflow να αναφέρουν εκτεταμένη χρήση κατά το παρελθόν έτος.';

const componentText = 'Τα components είναι τα βασικά δομικά στοιχεία της React. Το UI κάθε εφαρμογής που έχει '
  + 'δημιουργηθεί με τη React μπορεί να αναλυθεί σε μεμονωμένα κομμάτια που ονομάζονται '
  + 'components που είναι ανεξάρτητα το ένα από το άλλο. ';
const popupcomponentText = 'Τα components είναι τα βασικά δομικά στοιχεία της React. Το UI κάθε εφαρμογής που έχει '
  + 'δημιουργηθεί με τη React μπορεί να αναλυθεί σε μεμονωμένα κομμάτια που ονομάζονται '
  + 'components που είναι ανεξάρτητα το ένα από το άλλο.'
  + 'Κάθε ένα από αυτά τα components '
  + 'έχει τη δική του λογική και μπορεί να υποβληθεί σε επεξεργασία ξεχωριστά πριν '
  + 'συγχωνευθεί μαζί στο τελικό περιβάλλον χρήστη, γεγονός που καθιστά τη δημιουργία της '
  + 'διεπαφής χρήστη μιας εφαρμογής πιο απλή και πιο εύκολη στη διαχείριση. Τα components'
  + 'μπορούν επίσης να επαναχρησιμοποιηθούν σε άλλες σελίδες και εφαρμογές, γεγονός που '
  + 'εξοικονομεί σημαντικό χρόνο στην κωδικοποίηση.';

const jsxText = 'Το JSX, το οποίο σημαίνει JavaScript XML, είναι μια επέκταση σύνταξης της JavaScript που '
  + 'επιτρέπει στους προγραμματιστές να δομούν στοιχεία χρησιμοποιώντας γλώσσα παρόμοια '
  + 'με την HTML που είναι ενσωματωμένη στον κώδικα JavaScript. ';
const popupjsxText = 'Το JSX, το οποίο σημαίνει JavaScript XML, είναι μια επέκταση σύνταξης της JavaScript που '
  + 'επιτρέπει στους προγραμματιστές να δομούν στοιχεία χρησιμοποιώντας γλώσσα παρόμοια '
  + 'με την HTML που είναι ενσωματωμένη στον κώδικα JavaScript. '
  + 'Το JSX χρησιμοποιείται '
  + 'συνήθως για να περιγράψει πώς πρέπει να μοιάζει το UI ενός ιστότοπου, το οποίο η React'
  + 'στη συνέχεια μετατρέπει σε στοιχεία DOM. Ενώ το JSX δεν απαιτείται για τη δημιουργία '
  + 'εφαρμογών React, επιταχύνει τον προγραμματισμό απλοποιώντας τη γλώσσα '
  + 'κωδικοποίησης.';

const monodromhddText = 'Το DOM (Document Object Model) είναι ένα μοντέλο που μοιάζει με δέντρο που αντιπροσωπεύει τον'
  + 'τρόπο οργάνωσης των αντικειμένων διεπαφής χρήστη (UI) σε έναν ιστότοπο.';

const popupmonodromhddText = 'Το DOM (Document Object Model) είναι ένα μοντέλο που μοιάζει με δέντρο που αντιπροσωπεύει '
  + 'τον τρόπο οργάνωσης των αντικειμένων διεπαφής χρήστη (UI) σε έναν ιστότοπο. Πριν από τη React, το DOM έπρεπε να αποδίδεται'
  + 'εκ νέου κάθε φορά που γινόταν αλλαγή στη διεπαφή χρήστη μιας εφαρμογής, η οποία εμπόδιζε την απόκριση του ιστότοπου. '
  + 'Ένα από τα πιο χρήσιμα χαρακτηριστικά του React είναι η ικανότητά του να αλλάζει στοιχεία σε έναν ιστότοπο χωρίς να '
  + 'χρειάζεται να ενημερώσετε ολόκληρο το DOM. Αυτό επιτυγχάνεται μέσω του εικονικού DOM, το οποίο είναι μια εικονική αναπαράσταση '
  + 'ή αντίγραφο του DOM. Κάθε φορά που ένας χρήστης κάνει κάποια ενέργεια, όπως το κλικ σε ένα κουμπί, η React ενημερώνει το εικονικό DOM,'
  + 'συγκρίνει την ενημέρωση με την προηγούμενη έκδοση, εντοπίζει τις διαφορές και, στη συνέχεια, ενημερώνει μόνο τα επηρεαζόμενα αντικείμενα'
  + 'αντί να ανανεώνει ολόκληρο το DOM. Αυτό κάνει τον ιστότοπο πιο γρήγορο, πιο αποκριτικό και βελτιώνει την απόδοσή του.';

export {
  whatIsReactText,
  popupWhatIsReact,
  componentText,
  popupcomponentText,
  jsxText,
  popupjsxText,
  monodromhddText,
  popupmonodromhddText,
};
